Revit 2027 API
ZoneEquipmentData.IsDataCompleted Method
 Is the required data completed for this zone equipment?
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDataCompleted()
Public Function IsDataCompleted As Boolean
public:
bool IsDataCompleted()
member IsDataCompleted : unit -> bool
Return Value
Boolean
See Also
Reference
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace